Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Shape
The Shape class represents the shape filter expression.

Tekla.Structures.Filtering.Categories.ReinforcingBarFilterExpressions.Shape.#ctor
Initializes a new instance of the Shape class.